<template>
<div id="Agreenment">
    <div>
        <p class="tip" style="font-size:1.5rem;font-weight:bold">平台服务协议</p>
        <p class="text"><span style="font-weight:bold">特别提示：</span>在使用杭州跑跑网络科技有限公司的 平台(以下简称“跑跑”)服务之前，您应当认真阅读并遵守《 平台服务协议》(以下简称“本协议”)，请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、争议解决和法律适用条款。如您对协议有任何疑问的，应向跑跑客服咨询(咨询电话:)。 当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，或您按照激活页面提示填写信息、阅读并同意本协议且完成全部激活程序后，或您以其他跑跑允许的方式实际使用跑跑的服务时，即表示您已充分阅读、理解并接受本协议的全部内容，并与跑跑达成协议。您承诺接受并遵守本协议的约定，
             届时您不应以未阅读本协议的内容或者未获得跑跑对您问询的解答等理由，主张本协议无效，或要求撤销本协议。 </p>
    </div>
    <div>
        <p class="protocol"> 一、协议范围</p>
        <p class="text">&nbsp;	&nbsp;1、本协议由您与跑跑的经营者浙江跑跑网络科技有限公司共同缔结，对双方具有约束力。 
           <br><br>&nbsp;	&nbsp;2、除另行明确声明外，跑跑的服务包含任何跑跑及其关联公司提供的基于互联网以及移动网的相关服务，且均受本协议约束。如果您不同意本协议的约定，您应立即停止注册/激活程序或停止使用跑跑的服务。
           <br> <br>&nbsp;	&nbsp;3、本协议内容包括协议正文及所有跑跑已经发布或将来可能发布的各类规则、公告或通知(以下合称“跑跑规则”或“规则”)。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力，您确认并同意受前述内容的约束。
           <br> <br>&nbsp;	&nbsp;<span style="font-weight:bold"> 4、跑跑有权根据需要不时地制订、修改本协议及/或各类规则，并以跑跑官方网站(域名:)或app(名称)内公示的方式进行变更公告，无需另行单独通知您。变更后的协议和规则一经公布后，立即或在公告明确的特定时间自动生效。若您不同意相关变更，应当立即停止使用跑跑的服务。若您在前述变更公告后继续使用跑跑的服务，即表示您已经阅读、理解并接受经修订的协议和规则。
            </span>
        </p>
    </div>
    <div>
        <p class="protocol">二、 注册与账户</p> 
        <p class="text">&nbsp;	&nbsp;1、主体资格 
            <br><span style="font-weight:bold">您确认，在您完成注册程序或以其他跑跑允许的方式实际使用跑跑服务时，您应当是具备完全民事行为能力和完全民事权利能力的自然人、法人或其他组织。若您不具备前述主体资格，则您及您的监护人应承担因此而导致的一切后果，且跑跑有权注销或永久冻结您的账户，并向您及您的监护人索偿相应损失。</span>
            <br><br>&nbsp;&nbsp;2、注册和账户  
            <br><br>&nbsp;&nbsp;&nbsp;&nbsp;a)当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，或在您按照激活页面提示填写信息、阅读并同意本协议且完成全部激活程序后，或您以其他跑跑允许的方式实际使用跑跑的服务时，您即受本协议约束。您可以使用您提供或确认的手机号码作为登录方式进入跑跑。 
            <br><br>&nbsp;&nbsp;&nbsp;&nbsp;<span style="font-weight:bold">b)您可以对账户设置跑跑昵称，您设置的跑跑昵称不得侵犯或涉嫌侵犯他人合法权益。如您设置的跑跑昵称涉嫌侵犯他人合法权益，跑跑有权终止向您提供跑跑的相关服务，注销您的账号。 </span>
            <br><br>&nbsp;&nbsp;&nbsp;&nbsp;c)您的登录名、昵称和密码不得以任何方式买卖、转让、赠与或继承，除非有法律明确规定或司法裁定，并经跑跑同意，且需提供跑跑要求的合格的文件材料并根据跑跑制定的操作流程办理。
            <br><br>&nbsp;&nbsp;3、用户信息 
            <br><br>&nbsp;&nbsp;&nbsp;&nbsp;<span style="font-weight:bold">a)在注册或激活流程时，您应当依照法律法规要求，按相应页面的提示准确提供您的资料，并于资料信息变更时及时更新，以保证您所提交资料的真实、及时、完整和准确。如跑跑根据自身独立判断认为您提供的资料存在错误、不实、过时或不完整的风险时，跑跑有权向您发出询问及/或要求改正的通知，并有权直接做出删除相应资料的处理，直至中止、终止对您提供部分或全部跑跑平台服务。</span>
            <br><br>&nbsp;&nbsp;&nbsp;&nbsp;b)您应当准确填写并及时更新您提供的电子邮件地址、联系电话、联系地址、邮政编码等联系方式，以便跑跑或其他用户与您进行有效联系，因通过这些联系方式无法与您取得联系，导致您在使用跑跑服务过程中产生任何损失或增加费用的，应由您完全独自承担。您了解并同意，您有义务保持提供的联系方式的真实性和有效性，如有变更或需要更新的，您应按跑跑的要求进行操作。
            <br><br>&nbsp;&nbsp;4、账户安全<br> 您须自行负责对您的跑跑昵称、密码、安全及保密，且须对您在该登录名、跑跑昵称和密码下发生的所有活动(包括但不限于信息披露、发布信息、网上点击同意或提交各类规则协议、网上续签协议或购买服务等)承担责任。您同意：
            <br><br>&nbsp;&nbsp;&nbsp;&nbsp; a) 如发现任何人未经授权使用您的登录名、跑跑昵称和密码，或发生违反保密规定的任何其他情况，您会立即通知跑跑客服管理人员，并授权跑跑客服管理人员将该账号冻结；
            <br><br>&nbsp;&nbsp;&nbsp;&nbsp;b) 确保您在每个上网时段结束时，以正确步骤离开网站/服务。跑跑不能也不会对因您未能遵守本款规定而发生的任何损失负责。您理解跑跑对您的请求采取行动需要合理时间，跑跑对在采取行动前已经产生的后果(包括但不限于您的任何损失)不承担任何责任。
            <br><br>&nbsp;&nbsp;&nbsp;&nbsp;c)您因为手机丢失导致的经济等损失，跑跑不承担责任。
            </p>
     </div>
    <div>
        <p class="protocol">三、跑跑服务</p>
        <p class="text"> &nbsp;	&nbsp;1、跑跑将为您提供系列陪跑社交服务，您可在跑跑上提前预约陪跑服务，或提前发布陪跑信息，或参与跑跑组织的活动等，具体以所开通的平台提供的服务内容为准。跑跑作为提供陪跑社交服务的第三方平台，对于用户线下提供的前述服务不包括
            <br><br>&nbsp;&nbsp;2、您在跑跑上交易过程中与其他用户发生的交易纠纷，均与跑跑无关。但是，若您或其它用户任一方或双方共同提交跑跑要求调处，则跑跑作为独立第三方，有权根据单方判断做出调处决定，您了解并同意接受跑跑的判断和调处决定。
            <br><br>&nbsp;&nbsp;<span style="font-weight:bold"> 3、您了解并同意，跑跑有权应政府部门(包括司法及行政部门)的要求，向其提供您向跑跑提供的用户信息和交易记录等信息。如您涉嫌侵犯他人知识产权等合法权益，则跑跑亦有权在初步判断涉嫌侵权行为存在的情况下，向权利人提供您在跑跑登记的身份信息。</span>
            <br><br> &nbsp;&nbsp;4、关于服务付费的特别提示：针对跑跑提供的付费服务项目，相关收费服务内容及其价格说明，请在购买前仔细阅读说明页面。该服务说明页面上所载之内容构成本协议的一部分，且跑跑有权随时进行修改。
        </p>
    </div>
    <div>
        <p class="protocol1">四、跑跑平台服务使用规范</p>
        <p class="text">&nbsp;&nbsp; 1、在跑跑平台上使用跑跑服务过程中，您承诺遵守以下约定：
            <br><br> &nbsp;&nbsp;&nbsp;&nbsp;a)实施的所有行为均遵守国家法律、法规等规范性文件及跑跑各项规则的规定和要求，不违背社会公共利益或公共道德，不损害他人的合法权益，不偷逃应缴税费，不违反本协议及相关规则。
            <br><br> &nbsp;&nbsp;&nbsp;&nbsp;b)在与其他用户交易过程中，遵守诚实信用原则，不采取不正当竞争行为，不扰乱网上交易的正常秩序，不从事与网上交易无关的行为。
            <br><br>&nbsp;&nbsp;&nbsp;&nbsp;<span style="font-weight:bold">c)不发布国家禁止销售的或限制销售的商品或服务信息，不发布涉嫌侵犯他人知识产权或其它合法权益的商品或服务信息，不发布违背社会公共利益或公共道德或跑跑认为不适合在跑跑平台上销售的商品或服务信息，不发布其它涉嫌违法或违反本协议及各类规则的信息。</span>
            <br><br>&nbsp;&nbsp;&nbsp;&nbsp;d)不以包括但不限于虚构或歪曲事实等可能侵害其他用户合法权益的方式不当评价其他用户，不采取不正当方式制造或提高自身的信用度，不采取不正当方式制造或提高(降低)其他用户的信用度。
            <br><br>&nbsp;&nbsp;&nbsp;&nbsp; e)不对跑跑上的任何数据作商业性利用，包括但不限于在未经跑跑事先书面同意的情况下，以复制、传播等任何方式使用跑跑上展示的资料。
            <br><br> &nbsp;&nbsp;&nbsp;&nbsp;<span style="font-weight:bold">f)不使用任何装置、软件或例行程序干预或试图干预跑跑的正常运作或正在跑跑上进行的任何未经跑跑允许的交易、活动。您不得采取任何将导致不合理的庞大数据负载加诸跑跑网络设备的行动。</span>
            <br><br>&nbsp;&nbsp; 2、提交信息真实性声明：您必须对您在跑跑注册时填写的信息，及在跑跑公布、提交、张贴或显示的任何内容，或您通过本网站提供之服务传输给其他用户的任何内容的真实性、合法性负全部责任。
            <br><br> &nbsp;&nbsp;3、您了解并同意：
            <br> <br>&nbsp;&nbsp;&nbsp;	&nbsp;a)您如果违反本协议项下规定，产生任何法律后果的，您应以自己的名义独立承担所有的法律责任，并确保跑跑免于因此产生任何损失或增加费用。
            <br><br>&nbsp;&nbsp;&nbsp;&nbsp; b)不以虚构或歪曲事实的方式不恰当评价其他用户。如果您因任何其他用户因使用本网站或其提供之服务引起的行为，向其要求索赔或进行诉讼，您同意独自进行该类索赔或诉讼，不会要求我们协助举证或者将我们列为被告，而且您将豁免我们承担由该索赔或诉讼引起的任何相关联的所有索赔、责任和损失。
            <br><br> &nbsp;&nbsp;&nbsp;&nbsp;c)基于维护跑跑平台交易秩序及交易安全的需要，跑跑有权根据自身独立判断在认为存在发生恶意约跑等扰乱市场正常交易秩序风险的情形下，执行关闭相应交易订单等操作。
            <br><br> &nbsp;	&nbsp;&nbsp;&nbsp;d)经国家行政或司法机关的生效法律文书确认您存在违法或侵权行为，或者跑跑根据自身的判断，认为您的行为涉嫌违反法律法规的规定或涉嫌违反本协议和/或规则的条款的，则跑跑有权在跑跑平台上公示您的该等涉嫌违法或违约行为及跑跑已对您采取的措施。
            <br><br> &nbsp;&nbsp;&nbsp;&nbsp;e)对于您在跑跑平台上发布的涉嫌违法、涉嫌侵犯他人合法权利或违反本协议和/或规则的信息，跑跑有权不经通知您即予以删除，且按照规则的规定进行处罚。
            <br><br>&nbsp;	&nbsp;&nbsp;&nbsp; <span style="font-weight:bold">f)对于您违反本协议项下承诺，或您在跑跑平台上实施的行为，包括您未在跑跑平台上实施但已经对跑跑平台及其用户产生影响的行为，跑跑有权根据自身独立判断认定您行为的性质及是否构成对本协议和/或规则的违反，并根据单方认定结果适用规则予以处理或终止向您提供服务，且无须征得您的同意或提前通知予您。您应自行保存与您行为有关的全部证据，并应对无法提供充要证据而承担的不利后果。</span>
            <br><br> &nbsp;&nbsp;&nbsp;&nbsp;g)如您涉嫌违反有关法律或者本协议之规定，使跑跑遭受任何损失，或受到任何第三方的索赔，或受到任何行政管理部门的处罚，您应当赔偿跑跑因此造成的损失和/或发生的费用，包括合理的律师费用。</p>
    </div>
    <div>
        <p class="protocol">五、免责条款 </p>
        <p class="text">&nbsp;&nbsp;1、于缔结本协议时，您已同意就下列事由免除跑跑的法律责任：
        <br><br>&nbsp;&nbsp;&nbsp;&nbsp; a)我们会依据本协议为您提供服务，但您已理解并同意我们不保证所提供的服务将最终帮助您找到您的伴侣。 
        <br><br>&nbsp;&nbsp;&nbsp;&nbsp;<span style="font-weight:bold">b)您承认对于您利用本网站提供的服务或信息而从事的各类行为，包括在本网站发布各类信息，利用本网站提供之信息联系其他用户等，均为您个人行为且您个人对该类行为承担完全责任。</span>
        <br><br>&nbsp;&nbsp;&nbsp;&nbsp; c)对于用户上传的照片、资料、证件等信息，本网站已采用相关措施并已尽合理努力进行审核，但不保证其内容的正确性、合法性或可靠性，因此您在使用本网站时，可能会接触到令人不快、不适当或令人厌恶的内容。您同意在任何情况下，跑跑均不为其他用户经由跑跑以张贴、发送电子邮件或其它方式传送的任何内容负责。相关责任由上传上述内容的用户自行负责。对于上传的信息，您应以自己的独立判断来确定上传的照片的真实性、准确性，并独立承担可能产生的不利后果和责任，跑跑不承担任何法律责任。
        <br><br>&nbsp;&nbsp;&nbsp;&nbsp;  d)对于跑跑提供的各种广告信息、链接、资讯等(如有)，跑跑已采用相关措施并已尽合理努力进行审核；但并不就您与经由跑跑所提供之信息与前述广告主、广告经营者进行的联系或进行的商业往来做出任何承诺及保证，基于前述行为完全属于您和广告主、广告经营者之间的行为，与跑跑无关。对于前述商业往来所产生的任何损害或损失，跑跑不承担任何责任。
        <br><br>&nbsp;&nbsp;&nbsp;&nbsp;  <span style="font-weight:bold">e)是否使用跑跑的服务下载或取得任何资料应由您自行考虑并自负风险，您同意因任何资料的下载而导致您电脑系统的任何损坏或数据丢失等后果，跑跑不承担任何责任。</span>
        <br> <br>&nbsp;	&nbsp;&nbsp;&nbsp; f)对于您及其他用户自发组织的任何活动，或自发成立的组织的任何行为，跑跑不负责任。
        <br> <br>&nbsp;&nbsp;&nbsp;&nbsp; g)跑跑及其关联企业，对于您或任何第三人因以任何方式连接、或因使用、无法使用或使用的结果可能导致的任何金钱或其他损失或损害不承担任何责任(该等损失或损害包括但不限于，任何直接的、间接的、惩罚性的或必然的损失或伤害，或任何收入、利润、信誉、数据、合同、资金使用上的任何损失，或以任何方式由任何种类的业务中断引起或与之相关的损失或伤害，无论是民事侵权行为、合同还是其他)。</p>
    </div>
    <div>
        <p class="protocol"> 六、协议终止</p>
        <p class="text"> &nbsp;&nbsp;1、您同意，跑跑有权自行全权决定以任何理由不经事先通知的中止、终止向您提供部分或全部跑跑平台服务，暂时冻结或永久冻结(注销)您的账户在跑跑平台的权限，且无须为此向您或任何第三方承担任何责任。
            <br><br> &nbsp;	&nbsp;<span style="font-weight:bold">2、出现以下情况时，跑跑有权直接以注销账户的方式终止本协议，并有权永久冻结您的账户在跑跑平台的权限和收回账户对应的跑跑昵称。</span>
            <br>&nbsp;	&nbsp;&nbsp;	&nbsp;  a)跑跑终止向您提供服务后，您涉嫌一次直接或间接以他人名义注册为跑跑用户的；
            <br> &nbsp;	&nbsp;&nbsp;	&nbsp; b)您提供的用户信息中的主要内容不真实或不准确或不及时或不完整；<br> &nbsp;	&nbsp;&nbsp;	&nbsp; c)本协议(含规则)变更时，您明示并以书面形式通知跑跑不愿接受新的服务协议的；<br> &nbsp;	&nbsp;&nbsp;	&nbsp;d)其它跑跑认为应当终止服务的情况。
             <br>   <br>&nbsp;	&nbsp;3、您的账户服务被终止或者账户在跑跑平台的权限被永久冻结(注销)后，跑跑没有义务为您保留或向您披露您账户中的任何信息，也没有义务向您或第三方转发任何您未曾阅读或发送过的信息。<br><br> &nbsp;	&nbsp;4、您同意，您与跑跑的合同关系终止后，跑跑仍享有下列权利：
            <br> &nbsp;	&nbsp;&nbsp;	&nbsp; a）继续保存您的用户信息及您使用跑跑平台服务期间的所有交易信息。<br> &nbsp;	&nbsp;&nbsp;	&nbsp; b)您在使用跑跑平台服务期间存在违法行为或违反本协议和/或规则的行为的，跑跑仍可依据本协议向您主张权利。 <br><br>&nbsp;	&nbsp;<span style="font-weight:bold">5、跑跑中止或终止向您提供跑跑平台服务后，对于您在服务中止或终止之前的交易行为依下列原则处理，您应独力处理并完全承担进行以下处理所产生的任何争议、损失或增加的任何费用，并应确保跑跑免于因此产生任何损失或承担任何费用：</span>
            <br><br> &nbsp;	&nbsp;&nbsp;	&nbsp; a)您在服务中止或终止之前已经上传至跑跑平台的商品或服务尚未交易的，跑跑有权在中止或终止服务的同时删除此项商品或服务的相关信息； <br><br>&nbsp;	&nbsp;&nbsp;	&nbsp;b)您在服务中止或终止之前已经与其他用户达成交易约定，但尚未实际履行的，跑跑有权删除该交易商品或服务的相关信息；
            <br><br>&nbsp;	&nbsp;&nbsp;	&nbsp;  c)您在服务中止或终止之前已经与其他用户达成交易且已部分履行的，跑跑可以不删除该项交易，但跑跑有权在中止或终止服务的同时将相关情形通知您的交易对方，并收取相关服务费。</p>
    </div>
    <div>
        <p class="protocol">七、不可抗力</p>
        <p class="text">
            <br>&nbsp;&nbsp;&nbsp;	&nbsp;您同意并认可，对于因超出跑跑合理控制范围的任何事件或情况，包括但不限于战争、入侵、恐怖袭击、自然灾害或其他不可抗力，以及任何技术故障的发生、电气短路、第三方侵入本网站等情况所给您造成的任何损失或损害，跑跑无需承担任何赔偿责任，并不被视为违反本协议。
        </p>
    </div>
    <div>
        <p class="protocol1">八、法律适用、管辖与其他</p>
        <p class="text">&nbsp;	&nbsp;<span style="font-weight:bold">1、本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国大陆地区法律，如无相关法律规定的，则应参照通用国际商业惯例和/或行业惯例。</span>
            <br><br><br>&nbsp;	&nbsp; 2、本协议包含了您使用跑跑平台需遵守的一般性规范，您在使用跑跑平台时还需遵守适用于该平台的特殊性规范(具体请参见您与该平台签署的其他协议以及平台规则等内容)。跑跑的服务协议及相关规则发生冲突的，已时间在后的为准。
            <br><br>&nbsp;	&nbsp; 3、本协议项下所有的通知及新规则均可通过跑跑官方网站或app内重要页面公告、电子邮件或常规的信件传送等方式进行；该等通知于公布或发送之日视为已送达收件人。 鉴于跑跑已依法明确了上述条款、履行了格式条款制订方的义务，您进行下一步，将被视为且应当被视为您已经完全注意并同意了本协议所有条款尤其是提醒您注意的条款的合法性及有效性，您不应当以跑跑未对格式条款以合理方式提醒您注意，或未根据您要求尽到说明义务为理由而声称或要求法院或其它任何第三方确认相关条款非法或无效。</p>
    </div>
    <p class="text" style="padding-bottom:2.0rem">
        <br><span style="font-weight:bold">我已阅读并充分理解了以上协议中各条款，特别是涉及免除或者限制跑跑责任的免责条款，对我的权利限制的条款、争议解决和法律适用的条款，并且同意以上协议的全部内容。</span>
    </p>  
</div>
</template>
<style scoped>
div{
   margin: 0;
    color: #484646;
}
.Agreenment{
    background: #575555;
}
.protocol{
    margin-left: 0.6rem;
    width: 39%;
    font-size: 1.2rem;
    font-weight: bold;
}
.tip{
    padding-top: 1.0rem;
}
.protocol1{
    margin-left: 0.6rem;
    width: 65%;
    font-size: 1.2rem;
    font-weight: bold;
}
.text{
    text-align: left;
    margin: 1.1rem;
}
</style>
<script>
export default {
    name: 'Agreenment',
    beforeCreate(){
            document.getElementById('titleId').innerHTML = '跑跑平台服务协议';    
        },
}
</script>
